% 相对偏差
A = [1000,120,5000,1,50,1.5,1;
    700,60,4000,2,40,2,2;
    900,60,7000,1,70,1,4;
    800,70,8000,1.5,40,0.5,6;
    800,80,4000,2,30,2,5];  % 列为因素，行为方案
[m,n] = size(A);  % m为方案，n为因素
maxA = max(A);   % 每因素最大值
minA = min(A);   % 每因素最小值
G = maxA - minA;   
A1 = max(A(:,1));  % 因素1为效益型
A2 = min(A(:,2:n-1)); % 因素2-6为成本型
A3 = max(A(:,7));  % 因素7为效益型
u = [A1,A2,A3];  % 理想型矩阵
R = zeros(m,n);  % 模糊综合矩阵

% 模糊综合矩阵
for i = 1:m
    for j = 1:n
        R(i,j) = abs(A(i,j)-u(j)) / G(j); 
    end
end
% 利用变异系数求权向量
x = mean(A);  % 求每因素方差
s = std(A);  % 求每因素平均值
v = s ./ x;
v2 = sum(v);
c = zeros(1,n);
% 归一化
for i = 1:n
    c(i) = v(i) / v2;
end
F = R * c';
T = zeros(m,2);
% 降序排列，下标+相对偏差
[T(:,2),T(:,1)] = sortrows(F,1);

 
 